let a = 1, b = 1;

let c = ++a;
let d = b++;

// a = 2
// b = 2
// c = 2
// d = 1

let v = 2;
let x = 1 + (v *= 2);
// v = 4
// x = 1 + 4



// "" + 1 + 0 = 10
// "" - 1 + 0 = -1
// true + false = 1
// 6 / "3" = 2
// "2" * "3" = 6
// 4 + 5 + "px" = "9px"
// "$" + 4 + 5  = "$45"
// "4" - 2 = 2
// "4px" - 2 NaN
// "  -9  " + 5 = " -9  5" 
// "  -9  " - 5 = -14
// null + 1 = 1
// undefined + 1 = NaN
// " \t \n" - 2 = -2

let s = +prompt("Первое число?", 1);
let f = +prompt("Второе число?", 2);

alert(s + f);